NOTE: The terraform plan for prod also creates the aurora cluster, which is expected behavior since we renamed the current prod cluster prior to the prod config cutover.  This will let us migrate to a new aurora cluster down the road with correct storage allocation.

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.stateful.aws_db_parameter_group.default_mode will be destroyed
  - resource "aws_db_parameter_group" "default_mode" {
      - arn         = "arn:aws:rds:us-east-1:577373831711:pg:bfd-prod-default-mode-parameter-group" -> null
      - description = "Sets parameters for standard operation" -> null
      - family      = "postgres9.6" -> null
      - id          = "bfd-prod-default-mode-parameter-group" -> null
      - name        = "bfd-prod-default-mode-parameter-group" -> null
      - tags        = {} -> null

      - parameter {
          - apply_method = "immediate" -> null
          - name         = "auto_explain.log_min_duration" -> null
          - value        = "6000" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "default_statistics_target" -> null
          - value        = "1000" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "effective_io_concurrency" -> null
          - value        = "300" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "max_parallel_workers_per_gather" -> null
          - value        = "48" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "random_page_cost" -> null
          - value        = "1" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "temp_buffers" -> null
          - value        = "8192" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "work_mem" -> null
          - value        = "32768" -> null
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "max_wal_senders" -> null
          - value        = "15" -> null
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "max_worker_processes" -> null
          - value        = "96" -> null
        }
    }

  # module.stateful.aws_db_parameter_group.import_mode will be destroyed
  - resource "aws_db_parameter_group" "import_mode" {
      - arn         = "arn:aws:rds:us-east-1:577373831711:pg:bfd-prod-import-mode-parameter-group" -> null
      - description = "Sets parameters that optimize bulk data imports" -> null
      - family      = "postgres9.6" -> null
      - id          = "bfd-prod-import-mode-parameter-group" -> null
      - name        = "bfd-prod-import-mode-parameter-group" -> null
      - tags        = {} -> null

      - parameter {
          - apply_method = "immediate" -> null
          - name         = "autovacuum" -> null
          - value        = "0" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "checkpoint_timeout" -> null
          - value        = "1800" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "log_connections" -> null
          - value        = "1" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "maintenance_work_mem" -> null
          - value        = "4194304" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "synchronous_commit" -> null
          - value        = "off" -> null
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "max_wal_size" -> null
          - value        = "256" -> null
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "wal_buffers" -> null
          - value        = "8192" -> null
        }
    }

  # module.stateful.aws_db_subnet_group.db will be destroyed
  - resource "aws_db_subnet_group" "db" {
      - arn         = "arn:aws:rds:us-east-1:577373831711:subgrp:bfd-prod-subnet-group" -> null
      - description = "Managed by Terraform" -> null
      - id          = "bfd-prod-subnet-group" -> null
      - name        = "bfd-prod-subnet-group" -> null
      - subnet_ids  = [
          - "subnet-072b211370d47006a",
          - "subnet-0a6d8b4ffb8d264f0",
          - "subnet-0f2b35f641874f623",
        ] -> null
      - tags        = {
          - "Environment" = "prod"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
    }

  # module.stateful.aws_security_group.db will be destroyed
  - resource "aws_security_group" "db" {
      - arn                    = "arn:aws:ec2:us-east-1:577373831711:security-group/sg-054d0623e58df94de" -> null
      - description            = "Security group for replica DPC DB" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-054d0623e58df94de" -> null
      - ingress                = [] -> null
      - name                   = "bfd-prod-rds" -> null
      - owner_id               = "577373831711" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Environment" = "prod"
          - "Name"        = "bfd-prod-rds"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
      - vpc_id                 = "vpc-045cdabbd5bdb0427" -> null
    }

  # module.stateful.aws_security_group.master_db will be destroyed
  - resource "aws_security_group" "master_db" {
      - arn                    = "arn:aws:ec2:us-east-1:577373831711:security-group/sg-0c86a4b1fdd035130" -> null
      - description            = "Security group for master DPC DB" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0c86a4b1fdd035130" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow every replica db to call the master"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-054d0623e58df94de",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "bfd-prod-master-rds" -> null
      - owner_id               = "577373831711" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Environment" = "prod"
          - "Name"        = "bfd-prod-master-rds"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
      - vpc_id                 = "vpc-045cdabbd5bdb0427" -> null
    }

  # module.stateful.aws_security_group_rule.allow_master_access will be destroyed
  - resource "aws_security_group_rule" "allow_master_access" {
      - cidr_blocks              = [] -> null
      - description              = "Allow every replica db to call the master" -> null
      - from_port                = 5432 -> null
      - id                       = "sgrule-3143113278" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0c86a4b1fdd035130" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-054d0623e58df94de" -> null
      - to_port                  = 5432 -> null
      - type                     = "ingress" -> null
    }

  # module.stateful.module.aurora.aws_rds_cluster.aurora_cluster will be created
  + resource "aws_rds_cluster" "aurora_cluster" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = [
          + "us-east-1a",
          + "us-east-1b",
          + "us-east-1c",
        ]
      + backup_retention_period         = 21
      + cluster_identifier              = "bfd-prod-aurora-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = true
      + database_name                   = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "bfd-prod-aurora-cluster"
      + deletion_protection             = true
      + enabled_cloudwatch_logs_exports = [
          + "postgresql",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "11.6"
      + final_snapshot_identifier       = "bfd-prod-aurora-cluster-final"
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
      + master_password                 = (sensitive value)
      + master_username                 = "bfduser"
      + port                            = (known after apply)
      + preferred_backup_window         = "05:00-06:00"
      + preferred_maintenance_window    = "fri:07:00-fri:08:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + tags                            = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + vpc_security_group_ids          = [
          + "sg-0a2fb33487c23a233",
          + "sg-0a6734c1551266727",
          + "sg-0aee7caa9ab3c0914",
          + "sg-0c6ebfbf4a025956d",
        ]
    }

  # module.stateful.module.aurora.aws_rds_cluster_instance.aurora_nodes[0] will be created
  + resource "aws_rds_cluster_instance" "aurora_nodes" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = "us-east-1a"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = true
      + db_parameter_group_name         = "bfd-prod-aurora-node"
      + db_subnet_group_name            = "bfd-prod-aurora-cluster"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_version                  = "11.6"
      + id                              = (known after apply)
      + identifier                      = "bfd-prod-aurora-node-0"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.12xlarge"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 15
      + monitoring_role_arn             = "arn:aws:iam::577373831711:role/rds-monitoring-role"
      + performance_insights_enabled    = true
      + performance_insights_kms_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = "fri:07:00-fri:08:00"
      + promotion_tier                  = 0
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + writer                          = (known after apply)
    }

  # module.stateful.module.aurora.aws_rds_cluster_instance.aurora_nodes[1] will be created
  + resource "aws_rds_cluster_instance" "aurora_nodes" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = "us-east-1b"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = true
      + db_parameter_group_name         = "bfd-prod-aurora-node"
      + db_subnet_group_name            = "bfd-prod-aurora-cluster"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_version                  = "11.6"
      + id                              = (known after apply)
      + identifier                      = "bfd-prod-aurora-node-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.12xlarge"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 15
      + monitoring_role_arn             = "arn:aws:iam::577373831711:role/rds-monitoring-role"
      + performance_insights_enabled    = true
      + performance_insights_kms_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = "fri:07:00-fri:08:00"
      + promotion_tier                  = 0
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + writer                          = (known after apply)
    }

  # module.stateful.module.aurora.aws_rds_cluster_instance.aurora_nodes[2] will be created
  + resource "aws_rds_cluster_instance" "aurora_nodes" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = "us-east-1c"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = true
      + db_parameter_group_name         = "bfd-prod-aurora-node"
      + db_subnet_group_name            = "bfd-prod-aurora-cluster"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_version                  = "11.6"
      + id                              = (known after apply)
      + identifier                      = "bfd-prod-aurora-node-2"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.12xlarge"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 15
      + monitoring_role_arn             = "arn:aws:iam::577373831711:role/rds-monitoring-role"
      + performance_insights_enabled    = true
      + performance_insights_kms_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = "fri:07:00-fri:08:00"
      + promotion_tier                  = 0
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + writer                          = (known after apply)
    }

  # module.stateful.module.aurora.aws_route53_record.aurora_reader will be updated in-place
  ~ resource "aws_route53_record" "aurora_reader" {
        fqdn    = "aurora-reader.bfd-prod.local"
        id      = "Z0273533JQSRTP0OEGN6_aurora-reader_CNAME"
        name    = "aurora-reader"
      ~ records = [
          - "bfd-prod-aurora-cluster.cluster-ro-clyryngdhnko.us-east-1.rds.amazonaws.com",
        ] -> (known after apply)
        ttl     = 300
        type    = "CNAME"
        zone_id = "Z0273533JQSRTP0OEGN6"
    }

  # module.stateful.module.aurora.aws_route53_record.aurora_writer will be updated in-place
  ~ resource "aws_route53_record" "aurora_writer" {
        fqdn    = "aurora-writer.bfd-prod.local"
        id      = "Z0273533JQSRTP0OEGN6_aurora-writer_CNAME"
        name    = "aurora-writer"
      ~ records = [
          - "bfd-prod-aurora-cluster.cluster-clyryngdhnko.us-east-1.rds.amazonaws.com",
        ] -> (known after apply)
        ttl     = 300
        type    = "CNAME"
        zone_id = "Z0273533JQSRTP0OEGN6"
    }

  # module.stateful.module.master.aws_db_instance.db will be destroyed
  - resource "aws_db_instance" "db" {
      - address                               = "bfd-prod-master.clyryngdhnko.us-east-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 16000 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-east-1:577373831711:db:bfd-prod-master" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-east-1b" -> null
      - backup_retention_period               = 21 -> null
      - backup_window                         = "05:00-06:00" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - copy_tags_to_snapshot                 = true -> null
      - db_subnet_group_name                  = "bfd-prod-subnet-group" -> null
      - deletion_protection                   = true -> null
      - enabled_cloudwatch_logs_exports       = [
          - "postgresql",
          - "upgrade",
        ] -> null
      - endpoint                              = "bfd-prod-master.clyryngdhnko.us-east-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_version                        = "9.6.11" -> null
      - final_snapshot_identifier             = "bfd-prod-master-final" -> null
      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "bfd-prod-master" -> null
      - identifier                            = "bfd-prod-master" -> null
      - instance_class                        = "db.r5.12xlarge" -> null
      - iops                                  = 16000 -> null
      - kms_key_id                            = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - license_model                         = "postgresql-license" -> null
      - maintenance_window                    = "fri:07:00-fri:08:00" -> null
      - max_allocated_storage                 = 0 -> null
      - monitoring_interval                   = 15 -> null
      - monitoring_role_arn                   = "arn:aws:iam::577373831711:role/rds-monitoring-role" -> null
      - multi_az                              = false -> null
      - name                                  = "bfdtemp" -> null
      - option_group_name                     = "default:postgres-9-6" -> null
      - parameter_group_name                  = "bfd-prod-default-mode-parameter-group" -> null
      - password                              = (sensitive value)
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [
          - "bfd-prod-replica3",
          - "bfd-prod-replica1",
          - "bfd-prod-replica2",
        ] -> null
      - resource_id                           = "db-7V7HUAVDF5JP5W5S3APVNN4WDA" -> null
      - security_group_names                  = [] -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = true -> null
      - storage_type                          = "io1" -> null
      - tags                                  = {
          - "Environment" = "prod"
          - "Layer"       = "data"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "role"        = "master"
          - "stack"       = "prod"
        } -> null
      - username                              = "bfduser" -> null
      - vpc_security_group_ids                = [
          - "sg-0a2fb33487c23a233",
          - "sg-0a6734c1551266727",
          - "sg-0aee7caa9ab3c0914",
          - "sg-0c86a4b1fdd035130",
        ] -> null
    }

  # module.stateful.module.master.aws_route53_record.db will be destroyed
  - resource "aws_route53_record" "db" {
      - fqdn    = "master.bfd-prod.local" -> null
      - id      = "Z0273533JQSRTP0OEGN6_master_CNAME" -> null
      - name    = "master" -> null
      - records = [
          - "bfd-prod-master.clyryngdhnko.us-east-1.rds.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z0273533JQSRTP0OEGN6" -> null
    }

  # module.stateful.module.master_alarms.aws_cloudwatch_metric_alarm.rds_free_storage[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "rds_free_storage" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ] -> null
      - alarm_description         = "RDS - Free storage space is low for bfd-prod-master in APP-ENV: bfd-prod" -> null
      - alarm_name                = "bfd-prod-master-rds-free-storage" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-master-rds-free-storage" -> null
      - comparison_operator       = "LessThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBInstanceIdentifier" = "bfd-prod-master"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "bfd-prod-master-rds-free-storage" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "FreeStorageSpace" -> null
      - namespace                 = "AWS/RDS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - threshold                 = 50000000000 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.stateful.module.master_alarms.aws_cloudwatch_metric_alarm.rds_write_latency[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "rds_write_latency" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ] -> null
      - alarm_description         = "RDS - Write latency is high for bfd-prod-master in APP-ENV: bfd-prod" -> null
      - alarm_name                = "bfd-prod-master-rds-write-latency" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-master-rds-write-latency" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBInstanceIdentifier" = "bfd-prod-master"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "bfd-prod-master-rds-write-latency" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "WriteLatency" -> null
      - namespace                 = "AWS/RDS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - threshold                 = 0.2 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.stateful.module.replica1.aws_db_instance.db will be destroyed
  - resource "aws_db_instance" "db" {
      - address                               = "bfd-prod-replica1.clyryngdhnko.us-east-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 16000 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-east-1:577373831711:db:bfd-prod-replica1" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-east-1a" -> null
      - backup_retention_period               = 0 -> null
      - backup_window                         = "05:00-06:00" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - copy_tags_to_snapshot                 = true -> null
      - db_subnet_group_name                  = "bfd-prod-subnet-group" -> null
      - deletion_protection                   = true -> null
      - enabled_cloudwatch_logs_exports       = [
          - "postgresql",
          - "upgrade",
        ] -> null
      - endpoint                              = "bfd-prod-replica1.clyryngdhnko.us-east-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_version                        = "9.6.11" -> null
      - final_snapshot_identifier             = "bfd-prod-replica1-final" -> null
      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "bfd-prod-replica1" -> null
      - identifier                            = "bfd-prod-replica1" -> null
      - instance_class                        = "db.r5.12xlarge" -> null
      - iops                                  = 16000 -> null
      - kms_key_id                            = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - license_model                         = "postgresql-license" -> null
      - maintenance_window                    = "fri:07:00-fri:08:00" -> null
      - max_allocated_storage                 = 0 -> null
      - monitoring_interval                   = 15 -> null
      - monitoring_role_arn                   = "arn:aws:iam::577373831711:role/rds-monitoring-role" -> null
      - multi_az                              = false -> null
      - name                                  = "bfdtemp" -> null
      - option_group_name                     = "default:postgres-9-6" -> null
      - parameter_group_name                  = "bfd-prod-default-mode-parameter-group" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - replicate_source_db                   = "bfd-prod-master" -> null
      - resource_id                           = "db-M736V6Y7WBRSRAGQ6WU22YRCG4" -> null
      - security_group_names                  = [] -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = true -> null
      - storage_type                          = "io1" -> null
      - tags                                  = {
          - "Environment" = "prod"
          - "Layer"       = "data"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "role"        = "replica1"
          - "stack"       = "prod"
        } -> null
      - username                              = "bfduser" -> null
      - vpc_security_group_ids                = [
          - "sg-054d0623e58df94de",
          - "sg-0a2fb33487c23a233",
          - "sg-0a6734c1551266727",
          - "sg-0aee7caa9ab3c0914",
        ] -> null
    }

  # module.stateful.module.replica1.aws_route53_record.db will be destroyed
  - resource "aws_route53_record" "db" {
      - fqdn    = "replica1.bfd-prod.local" -> null
      - id      = "Z0273533JQSRTP0OEGN6_replica1_CNAME" -> null
      - name    = "replica1" -> null
      - records = [
          - "bfd-prod-replica1.clyryngdhnko.us-east-1.rds.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z0273533JQSRTP0OEGN6" -> null
    }

  # module.stateful.module.replica1_alarms.aws_cloudwatch_metric_alarm.rds_read_latency[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "rds_read_latency" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ] -> null
      - alarm_description         = "RDS - Read latency is high for bfd-prod-replica1 in APP-ENV: bfd-prod" -> null
      - alarm_name                = "bfd-prod-replica1-rds-read-latency" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-replica1-rds-read-latency" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBInstanceIdentifier" = "bfd-prod-replica1"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "bfd-prod-replica1-rds-read-latency" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ReadLatency" -> null
      - namespace                 = "AWS/RDS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - threshold                 = 0.2 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.stateful.module.replica1_alarms.aws_cloudwatch_metric_alarm.rds_replica_lag[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "rds_replica_lag" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ] -> null
      - alarm_description         = "RDS - Replica Lag is high for bfd-prod-replica1 in APP-ENV: bfd-prod" -> null
      - alarm_name                = "bfd-prod-replica1-rds-replica-lag" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-replica1-rds-replica-lag" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBInstanceIdentifier" = "bfd-prod-replica1"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "bfd-prod-replica1-rds-replica-lag" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ReplicaLag" -> null
      - namespace                 = "AWS/RDS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ] -> null
      - period                    = 3600 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - threshold                 = 1800 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.stateful.module.replica2.aws_db_instance.db will be destroyed
  - resource "aws_db_instance" "db" {
      - address                               = "bfd-prod-replica2.clyryngdhnko.us-east-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 16000 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-east-1:577373831711:db:bfd-prod-replica2" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-east-1b" -> null
      - backup_retention_period               = 0 -> null
      - backup_window                         = "05:00-06:00" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - copy_tags_to_snapshot                 = true -> null
      - db_subnet_group_name                  = "bfd-prod-subnet-group" -> null
      - deletion_protection                   = true -> null
      - enabled_cloudwatch_logs_exports       = [
          - "postgresql",
          - "upgrade",
        ] -> null
      - endpoint                              = "bfd-prod-replica2.clyryngdhnko.us-east-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_version                        = "9.6.11" -> null
      - final_snapshot_identifier             = "bfd-prod-replica2-final" -> null
      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "bfd-prod-replica2" -> null
      - identifier                            = "bfd-prod-replica2" -> null
      - instance_class                        = "db.r5.12xlarge" -> null
      - iops                                  = 16000 -> null
      - kms_key_id                            = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - license_model                         = "postgresql-license" -> null
      - maintenance_window                    = "fri:07:00-fri:08:00" -> null
      - max_allocated_storage                 = 0 -> null
      - monitoring_interval                   = 15 -> null
      - monitoring_role_arn                   = "arn:aws:iam::577373831711:role/rds-monitoring-role" -> null
      - multi_az                              = false -> null
      - name                                  = "bfdtemp" -> null
      - option_group_name                     = "default:postgres-9-6" -> null
      - parameter_group_name                  = "bfd-prod-default-mode-parameter-group" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - replicate_source_db                   = "bfd-prod-master" -> null
      - resource_id                           = "db-36LTZ4USZTY2ATGZCVYHJ6P7YU" -> null
      - security_group_names                  = [] -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = true -> null
      - storage_type                          = "io1" -> null
      - tags                                  = {
          - "Environment" = "prod"
          - "Layer"       = "data"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "role"        = "replica2"
          - "stack"       = "prod"
        } -> null
      - username                              = "bfduser" -> null
      - vpc_security_group_ids                = [
          - "sg-054d0623e58df94de",
          - "sg-0a2fb33487c23a233",
          - "sg-0a6734c1551266727",
          - "sg-0aee7caa9ab3c0914",
        ] -> null
    }

  # module.stateful.module.replica2.aws_route53_record.db will be destroyed
  - resource "aws_route53_record" "db" {
      - fqdn    = "replica2.bfd-prod.local" -> null
      - id      = "Z0273533JQSRTP0OEGN6_replica2_CNAME" -> null
      - name    = "replica2" -> null
      - records = [
          - "bfd-prod-replica2.clyryngdhnko.us-east-1.rds.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z0273533JQSRTP0OEGN6" -> null
    }

  # module.stateful.module.replica2_alarms.aws_cloudwatch_metric_alarm.rds_read_latency[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "rds_read_latency" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ] -> null
      - alarm_description         = "RDS - Read latency is high for bfd-prod-replica2 in APP-ENV: bfd-prod" -> null
      - alarm_name                = "bfd-prod-replica2-rds-read-latency" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-replica2-rds-read-latency" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBInstanceIdentifier" = "bfd-prod-replica2"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "bfd-prod-replica2-rds-read-latency" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ReadLatency" -> null
      - namespace                 = "AWS/RDS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - threshold                 = 0.2 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.stateful.module.replica2_alarms.aws_cloudwatch_metric_alarm.rds_replica_lag[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "rds_replica_lag" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ] -> null
      - alarm_description         = "RDS - Replica Lag is high for bfd-prod-replica2 in APP-ENV: bfd-prod" -> null
      - alarm_name                = "bfd-prod-replica2-rds-replica-lag" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-replica2-rds-replica-lag" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBInstanceIdentifier" = "bfd-prod-replica2"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "bfd-prod-replica2-rds-replica-lag" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ReplicaLag" -> null
      - namespace                 = "AWS/RDS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ] -> null
      - period                    = 3600 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - threshold                 = 1800 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.stateful.module.replica3.aws_db_instance.db will be destroyed
  - resource "aws_db_instance" "db" {
      - address                               = "bfd-prod-replica3.clyryngdhnko.us-east-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 16000 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-east-1:577373831711:db:bfd-prod-replica3" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-east-1c" -> null
      - backup_retention_period               = 0 -> null
      - backup_window                         = "05:00-06:00" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - copy_tags_to_snapshot                 = true -> null
      - db_subnet_group_name                  = "bfd-prod-subnet-group" -> null
      - deletion_protection                   = true -> null
      - enabled_cloudwatch_logs_exports       = [
          - "postgresql",
          - "upgrade",
        ] -> null
      - endpoint                              = "bfd-prod-replica3.clyryngdhnko.us-east-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_version                        = "9.6.11" -> null
      - final_snapshot_identifier             = "bfd-prod-replica3-final" -> null
      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "bfd-prod-replica3" -> null
      - identifier                            = "bfd-prod-replica3" -> null
      - instance_class                        = "db.r5.12xlarge" -> null
      - iops                                  = 16000 -> null
      - kms_key_id                            = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - license_model                         = "postgresql-license" -> null
      - maintenance_window                    = "fri:07:00-fri:08:00" -> null
      - max_allocated_storage                 = 0 -> null
      - monitoring_interval                   = 15 -> null
      - monitoring_role_arn                   = "arn:aws:iam::577373831711:role/rds-monitoring-role" -> null
      - multi_az                              = false -> null
      - name                                  = "bfdtemp" -> null
      - option_group_name                     = "default:postgres-9-6" -> null
      - parameter_group_name                  = "bfd-prod-default-mode-parameter-group" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - replicate_source_db                   = "bfd-prod-master" -> null
      - resource_id                           = "db-XBXMSXOJFJFWIUKWTADYPKG6JE" -> null
      - security_group_names                  = [] -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = true -> null
      - storage_type                          = "io1" -> null
      - tags                                  = {
          - "Environment" = "prod"
          - "Layer"       = "data"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "role"        = "replica3"
          - "stack"       = "prod"
        } -> null
      - username                              = "bfduser" -> null
      - vpc_security_group_ids                = [
          - "sg-054d0623e58df94de",
          - "sg-0a2fb33487c23a233",
          - "sg-0a6734c1551266727",
          - "sg-0aee7caa9ab3c0914",
        ] -> null
    }

  # module.stateful.module.replica3.aws_route53_record.db will be destroyed
  - resource "aws_route53_record" "db" {
      - fqdn    = "replica3.bfd-prod.local" -> null
      - id      = "Z0273533JQSRTP0OEGN6_replica3_CNAME" -> null
      - name    = "replica3" -> null
      - records = [
          - "bfd-prod-replica3.clyryngdhnko.us-east-1.rds.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z0273533JQSRTP0OEGN6" -> null
    }

  # module.stateful.module.replica3_alarms.aws_cloudwatch_metric_alarm.rds_read_latency[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "rds_read_latency" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ] -> null
      - alarm_description         = "RDS - Read latency is high for bfd-prod-replica3 in APP-ENV: bfd-prod" -> null
      - alarm_name                = "bfd-prod-replica3-rds-read-latency" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-replica3-rds-read-latency" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBInstanceIdentifier" = "bfd-prod-replica3"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "bfd-prod-replica3-rds-read-latency" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ReadLatency" -> null
      - namespace                 = "AWS/RDS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - threshold                 = 0.2 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.stateful.module.replica3_alarms.aws_cloudwatch_metric_alarm.rds_replica_lag[0] will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "rds_replica_lag" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ] -> null
      - alarm_description         = "RDS - Replica Lag is high for bfd-prod-replica3 in APP-ENV: bfd-prod" -> null
      - alarm_name                = "bfd-prod-replica3-rds-replica-lag" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-prod-replica3-rds-replica-lag" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBInstanceIdentifier" = "bfd-prod-replica3"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "bfd-prod-replica3-rds-replica-lag" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ReplicaLag" -> null
      - namespace                 = "AWS/RDS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ] -> null
      - period                    = 3600 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - threshold                 = 1800 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

Plan: 4 to add, 2 to change, 22 to destroy.